UdaySinghG70/MCXA156/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe0 0x00u          /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u            /*!<@brief Pull Enable: Enables */
#define PORT2_PCR20_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR21_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR22_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT4_PCR3_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT4_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT4_PCR7_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT4_6 (number 27), E
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_E_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_E_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_E_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_E_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_E_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_E_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_E_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT4_7 (number 28), RS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_RS_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RS_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_RS_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_RS_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_RS_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_RS_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_RS_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_1 (number 34), D0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D0_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D0_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D0_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D0_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D0_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D0_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT2_20 (number 55), D1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D1_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D1_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D1_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D1_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D1_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D1_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_21 (number 56), D2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D2_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D2_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D2_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D2_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D2_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D2_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_3 (number 24), D3
  @{ */

