UdaySinghG70/MCXA156/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D3_GPIO GPIO4               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D3_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D3_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D3_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_12 (number 92), D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D4_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D4_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D4_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D4_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D4_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D4_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D4_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_13 (number 91), D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D5_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D5_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D5_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D5_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D5_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_15 (number 89), D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D6_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D6_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D6_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D6_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D6_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D6_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D6_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_16 (number 88), D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_D7_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D7_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITDEBUG_UARTPINS_D7_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_D7_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_D7_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D7_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D7_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_22 (number 81), KEY1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_KEY1_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_KEY1_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_KEY1_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_KEY1_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_KEY1_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_KEY1_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT3_17 (number 87), KEY2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_KEY2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_KEY2_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_KEY2_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_KEY2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_KEY2_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_KEY2_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT3_1 (number 105), KEY3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_KEY3_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_KEY3_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITDEBUG_UARTPINS_KEY3_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_KEY3_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_KEY3_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_KEY3_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT2_22 (number 57), KEY4
  @{ */

