UdaySinghG70/MCXA156/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITI2CPINS_D7_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITI2CPINS_D7_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITI2CPINS_D7_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITI2CPINS_D7_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITI2CPINS_D7_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2CPINS_D7_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITI2CPINS_D7_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI3CPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSLCDPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
